{"_name_or_path": "bert-base-cased", "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "gradient_checkpointing": false, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "O", "1": "B-GEO", "2": "B-GPE", "3": "B-PER", "4": "I-GEO", "5": "B-ORG", "6": "I-ORG", "7": "B-TIM", "8": "B-ART", "9": "I-ART", "10": "I-PER", "11": "I-GPE", "12": "I-TIM", "13": "B-NAT", "14": "B-EVE", "15": "I-EVE", "16": "I-NAT"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"O": 0, "B-GEO": 1, "B-GPE": 2, "B-PER": 3, "I-GEO": 4, "B-ORG": 5, "I-ORG": 6, "B-TIM": 7, "B-ART": 8, "I-ART": 9, "I-PER": 10, "I-GPE": 11, "I-TIM": 12, "B-NAT": 13, "B-EVE": 14, "I-EVE": 15, "I-NAT": 16}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 12, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.40.1", "type_vocab_size": 2, "use_cache": true, "vocab_size": 28996}